РП/src/Documents/ПлановаяКалькуляция/ПлановаяКалькуляция.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПлановаяКалькуляция</name>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыПлановыхКалькуляций</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаДействия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияДействия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДетализироватьСтатьиКалькуляции</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидЦены</name>
    <type>
      <types>CatalogRef.ВидыЦен</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КалькуляционнаяЕдиница</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбъектКалькуляции</name>
    <type>
      <types>EnumRef.ОбъектыКалькуляции</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыводитьИерархиюСтатейКалькуляции</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьОрганизацию</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаПоДокументу</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КраткийСоставДокумента</name>
    <comment>Краткий перечень объектов калькуляции</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ДействиеКалькуляции</name>
    <attributes>
      <name>Объект</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
        <types>DocumentRef.ЗаказНаПроизводство</types>
        <types>CatalogRef.РесурсныеСпецификации</types>
        <types>DocumentRef.ЗаказКлиента</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>КодСтрокиЗаказаНаПроизводство</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИспользоватьХарактеристику</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СтатьиКалькуляции</name>
    <attributes>
      <name>СтатьяКалькуляции</name>
      <type>
        <types>CatalogRef.СтатьиКалькуляции</types>
      </type>
    </attributes>
    <attributes>
      <name>СпособРасчета</name>
      <type>
        <types>EnumRef.СпособыРасчетаЗатратПлановойКалькуляции</types>
      </type>
    </attributes>
    <attributes>
      <name>Формула</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ВозвратныеОтходы</name>
    <attributes>
      <name>СтатьяКалькуляции</name>
      <type>
        <types>CatalogRef.СтатьиКалькуляции</types>
      </type>
    </attributes>
    <attributes>
      <name>ОписаниеИзделия</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидЦены</name>
      <type>
        <types>CatalogRef.ВидыЦен</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>МатериалыИУслуги</name>
    <attributes>
      <name>СтатьяКалькуляции</name>
      <type>
        <types>CatalogRef.СтатьиКалькуляции</types>
      </type>
    </attributes>
    <attributes>
      <name>ПрименениеМатериала</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидЦены</name>
      <type>
        <types>CatalogRef.ВидыЦен</types>
      </type>
    </attributes>
    <attributes>
      <name>Калькуляция</name>
      <type>
        <types>DocumentRef.ПлановаяКалькуляция</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Трудозатраты</name>
    <attributes>
      <name>СтатьяКалькуляции</name>
      <type>
        <types>CatalogRef.СтатьиКалькуляции</types>
      </type>
    </attributes>
    <attributes>
      <name>НазначениеРабот</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидРабот</name>
      <type>
        <types>CatalogRef.ВидыРаботСотрудников</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Расценка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СтатьиРасходов</name>
    <attributes>
      <name>СтатьяКалькуляции</name>
      <type>
        <types>CatalogRef.СтатьиКалькуляции</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатьяРасходов</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.СтатьиРасходов</types>
      </type>
    </attributes>
    <attributes>
      <name>РасчетПоФормуле</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Формула</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ВлияющиеСтатьиКалькуляции</name>
    <attributes>
      <name>СтатьяКалькуляции</name>
      <type>
        <types>CatalogRef.СтатьиКалькуляции</types>
      </type>
    </attributes>
    <attributes>
      <name>ВлияющаяСтатьяКалькуляции</name>
      <type>
        <types>CatalogRef.СтатьиКалькуляции</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

РП/src/Enums/ОбъектыКалькуляции/ОбъектыКалькуляции.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ОбъектыКалькуляции</name>
  <enumValues>
    <name>Изделие</name>
  </enumValues>
  <enumValues>
    <name>РесурснаяСпецификация</name>
  </enumValues>
  <enumValues>
    <name>ЗаказНаПроизводство</name>
  </enumValues>
</mdclass:Enum>

РП/src/Enums/СтатусыПлановыхКалькуляций/СтатусыПлановыхКалькуляций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыПлановыхКалькуляций</name>
  <enumValues>
    <name>ВРазработке</name>
  </enumValues>
  <enumValues>
    <name>Действует</name>
  </enumValues>
</mdclass:Enum>

РП/src/Catalogs/ХарактеристикиНоменклатуры/ХарактеристикиНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ХарактеристикиНоменклатуры</name>
  <owners>Catalog.ВидыНоменклатуры</owners>
  <owners>Catalog.Номенклатура</owners>
  <attributes>
    <name>НаименованиеПолное</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Принципал</name>
    <type>
      <types>CatalogRef.Организации</types>
      <types>CatalogRef.Партнеры</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Организации</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

РП/src/Documents/ПлановаяКалькуляция/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПриКопировании(ОбъектКопирования)
	
	ИнициализироватьДокумент();
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Перем ТипОснования;
	
	ИнициализироватьДокумент(ДанныеЗаполнения);
	ТипЗначенияЗаполнения = ТипЗнч(ДанныеЗаполнения);
	
	Если ТипЗначенияЗаполнения = Тип("Структура") Тогда
		
		ДанныеЗаполнения.Свойство("ТипОснования", ТипОснования);
		
		Если ТипОснования = Тип("СправочникСсылка.РесурсныеСпецификации") Тогда
			ЗаполнитьНаОснованииСпискаСпецификаций(ДанныеЗаполнения.МассивОбъектов);
		ИначеЕсли ТипОснования = Тип("ДокументСсылка.ЗаказНаПроизводство") Тогда
			ЗаполнитьНаОснованииСпискаПозицийЗаказов(ДанныеЗаполнения.МассивОбъектов);
		ИначеЕсли ТипОснования = Тип("СправочникСсылка.Номенклатура") Тогда
			ЗаполнитьНаОснованииСпискаНоменклатуры(ДанныеЗаполнения.МассивОбъектов);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	МассивНепроверяемыхРеквизитов = Новый Массив;
	
	Если Не ИспользоватьОрганизацию Тогда
		МассивНепроверяемыхРеквизитов.Добавить("Организация");
	КонецЕсли;
	
	// Дата окончания действия соглашения должна быть не меньше, чем дата начала действия.
	Если ЗначениеЗаполнено(ДатаНачалаДействия) И ЗначениеЗаполнено(ДатаОкончанияДействия) Тогда
		Если ДатаНачалаДействия > ДатаОкончанияДействия Тогда
			
			ТекстОшибки = НСтр("ru='Дата окончания действия калькуляции должна быть не меньше даты начала';uk='Дата закінчення дії калькуляції повинна бути не менше дати початку'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				ТекстОшибки,
				ЭтотОбъект, 
				"ДатаОкончанияДействия",
				,
				Отказ);
			
		Конецесли;
	КонецЕсли;
	
	Если СтатьиКалькуляции.Итог("Сумма") < 0 Тогда
			ТекстОшибки = НСтр("ru='Итоговая сумма не может быть отрицательной.';uk='Підсумкова сума не може бути від''ємною.'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				ТекстОшибки,
				ЭтотОбъект, 
				"СтатьиКалькуляции",
				,
				Отказ);
	КонецЕсли;
	
	Если ОбъектКалькуляции <> Перечисления.ОбъектыКалькуляции.Изделие Тогда
		МассивНепроверяемыхРеквизитов.Добавить("КалькуляционнаяЕдиница");
	КонецЕсли;
	
	ПроверитьОбластьДействия(Отказ);
	
	ПараметрыПроверки = ОбщегоНазначенияУТ.ПараметрыПроверкиЗаполненияКоличества();
	ПараметрыПроверки.ИмяТЧ = "ВозвратныеОтходы";
	ОбщегоНазначенияУТ.ПроверитьЗаполнениеКоличества(ЭтотОбъект, ПроверяемыеРеквизиты, Отказ, ПараметрыПроверки);
	
	ПараметрыПроверки.ИмяТЧ = "МатериалыИУслуги";
	ОбщегоНазначенияУТ.ПроверитьЗаполнениеКоличества(ЭтотОбъект, ПроверяемыеРеквизиты, Отказ, ПараметрыПроверки);
	
	МассивНепроверяемыхРеквизитов.Добавить("СтатьиКалькуляции.Формула");
	МассивНепроверяемыхРеквизитов.Добавить("СтатьиРасходов.Формула");
	
	// Удалим не проверяемые реквизиты
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(
		ПроверяемыеРеквизиты,
		МассивНепроверяемыхРеквизитов);
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект);
	ПроведениеСервер.УстановитьРежимПроведения(ЭтотОбъект, РежимЗаписи, РежимПроведения);
	СуммаПоДокументу = СтатьиКалькуляции.Итог("Сумма");
	ДополнительныеСвойства.Вставить("ЭтоНовый",    ЭтоНовый());
	ДополнительныеСвойства.Вставить("РежимЗаписи", РежимЗаписи);
	
	ПараметрыОкругления = ОбщегоНазначенияУТ.ПараметрыОкругленияКоличестваШтучныхТоваров();
	ПараметрыОкругления.ИмяТЧ = "ВозвратныеОтходы";
	ОбщегоНазначенияУТ.ОкруглитьКоличествоШтучныхТоваров(ЭтотОбъект, РежимЗаписи, ПараметрыОкругления);
	ПараметрыОкругления.ИмяТЧ = "МатериалыИУслуги";
	ОбщегоНазначенияУТ.ОкруглитьКоличествоШтучныхТоваров(ЭтотОбъект, РежимЗаписи, ПараметрыОкругления);
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ПроверитьОбластьДействия(Отказ)
	
	Сообщения = Новый Соответствие;
	Сообщения.Вставить(Перечисления.ОбъектыКалькуляции.Изделие, НСтр("ru='Не указано изделие, для которого действует калькуляция.';uk='Не зазначено виріб, для якого діє калькуляція.'"));
	Сообщения.Вставить(Перечисления.ОбъектыКалькуляции.РесурснаяСпецификация, НСтр("ru='Не указана спецификация, для которой действует калькуляция.';uk='Не зазначена специфікація, для якої діє калькуляція.'"));
	Сообщения.Вставить(Перечисления.ОбъектыКалькуляции.ЗаказНаПроизводство, НСтр("ru='Не указана позиция заказа, для которой действует калькуляция.';uk='Не зазначена позиція замовлення, для якої діє калькуляція.'"));
	Сообщения.Вставить("ОшибкаПозицииЗаказа", НСтр("ru='Позиция заказа на производство указана не корректно.';uk='Позиція замовлення на виробництво вказана не коректно.'"));
	Сообщения.Вставить("ОшибкаХарактеристики", НСтр("ru='Не заполнено поле ""Характеристика"" для изделия.';uk='Не заповнено поле ""Характеристика"" для виробу.'"));
	Сообщения.Вставить("ОшибкаЕдиницыИзмерения", НСтр("ru='Изделия, для которых действует калькуляция, имеют разные единицы измерения.
        |Плановая калькуляция может применяться для однородных изделий.'
        |;uk='Вироби, для яких діє калькуляція, мають різні одиниці вимірювання.
        |Планова калькуляція може застосовуватися для однорідних виробів.'"));
	
	Если ДействиеКалькуляции.Количество() = 0 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Сообщения[ОбъектКалькуляции], ЭтотОбъект, ,, Отказ);
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ДействиеКалькуляции.Объект КАК Объект,
	|	ДействиеКалькуляции.КодСтрокиЗаказаНаПроизводство КАК КодСтрокиЗаказаНаПроизводство,
	|	ДействиеКалькуляции.ИспользоватьХарактеристику КАк ИспользоватьХарактеристику,
	|	ДействиеКалькуляции.Характеристика КАК Характеристика
	|ПОМЕСТИТЬ ВТДействиеКалькуляции
	|ИЗ
	|	&ДействиеКалькуляции КАК ДействиеКалькуляции
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА ВТДействиеКалькуляции.Объект ССЫЛКА Документ.ЗаказНаПроизводство
	|					И ВТДействиеКалькуляции.КодСтрокиЗаказаНаПроизводство = 0
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ) КАК ОшибкаПозицииЗаказа,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА ВТДействиеКалькуляции.ИспользоватьХарактеристику
	|					И ВТДействиеКалькуляции.Характеристика = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ) КАК ОшибкаХарактеристики,
	|	МИНИМУМ(ВЫБОР
	|			КОГДА ВТДействиеКалькуляции.Объект ССЫЛКА Справочник.Номенклатура
	|				ТОГДА ВТДействиеКалькуляции.Объект.ЕдиницаИзмерения
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК МинЕдиницаИзмерения,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА ВТДействиеКалькуляции.Объект ССЫЛКА Справочник.Номенклатура
	|				ТОГДА ВТДействиеКалькуляции.Объект.ЕдиницаИзмерения
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК МаксЕдиницаИзмерения
	|ИЗ
	|	ВТДействиеКалькуляции КАК ВТДействиеКалькуляции");
	
	Запрос.УстановитьПараметр("ДействиеКалькуляции", ДействиеКалькуляции.Выгрузить());
	Выборка = Запрос.Выполнить().Выбрать();
	
	ОшибкаОбластиДействия = Ложь;
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.ОшибкаПозицииЗаказа Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Сообщения["ОшибкаПозицииЗаказа"], ЭтотОбъект, ,, Отказ);
		КонецЕсли;
		
		Если Выборка.ОшибкаХарактеристики Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Сообщения["ОшибкаХарактеристики"], ЭтотОбъект, ,, Отказ);
		КонецЕсли;
		
		Если Выборка.МинЕдиницаИзмерения <> Выборка.МаксЕдиницаИзмерения Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Сообщения["ОшибкаЕдиницыИзмерения"], ЭтотОбъект, ,, Отказ);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ИнициализироватьДокумент(ДанныеЗаполнения = Неопределено)
	
	Ответственный			= ПараметрыСеанса.ТекущийПользователь;
	ДатаНачалаДействия		= НачалоДня(ТекущаяДатаСеанса());
	Статус						= Перечисления.СтатусыПлановыхКалькуляций.ВРазработке;
	Валюта						= Константы.ВалютаПлановойСебестоимостиПродукции.Получить();
	ВидЦены					= Константы.ВидЦеныПлановойСтоимостиМатериаловРабот.Получить();
	
	Если Не ЗначениеЗаполнено(Валюта) Тогда
		Константы.ВалютаПлановойСебестоимостиПродукции.СоздатьМенеджерЗначения().СообщитьКонстантаНеЗаполненаИВызватьИсключение();
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьНаОснованииСпискаНоменклатуры(МассивОбъектов)
	
	ОбъектКалькуляции = Перечисления.ОбъектыКалькуляции.Изделие;
	ДетализироватьСтатьиКалькуляции = Истина;
	
	Для Каждого Строка Из МассивОбъектов Цикл
		НоваяСтрока = ДействиеКалькуляции.Добавить();
		НоваяСтрока.Объект = Строка;
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьНаОснованииСпискаСпецификаций(МассивОбъектов)
	
	ОбъектКалькуляции = Перечисления.ОбъектыКалькуляции.РесурснаяСпецификация;
	ДетализироватьСтатьиКалькуляции = Истина;
	
	Для Каждого Строка Из МассивОбъектов Цикл
		НоваяСтрока = ДействиеКалькуляции.Добавить();
		НоваяСтрока.Объект = Строка;
	КонецЦикла;
	
	Если ДействиеКалькуляции.Количество() = 1 Тогда
		Документы.ПлановаяКалькуляция.ЗаполнитьПоСпецификации(ЭтотОбъект, ДействиеКалькуляции[0].Объект);
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьНаОснованииСпискаПозицийЗаказов(МассивОбъектов)
	
	ОбъектКалькуляции = Перечисления.ОбъектыКалькуляции.ЗаказНаПроизводство;
	ДетализироватьСтатьиКалькуляции = Истина;
	
	Для Каждого Строка Из МассивОбъектов Цикл
		НоваяСтрока = ДействиеКалькуляции.Добавить();
		НоваяСтрока.Объект = Строка.ЗаказНапроизводство;
		НоваяСтрока.КодСтрокиЗаказаНаПроизводство = Строка.КодСтрокиЗаказаНаПроизводство;
	КонецЦикла;
	
	Если ДействиеКалькуляции.Количество() = 1 Тогда
		Документы.ПлановаяКалькуляция.ЗаполнитьПоСпецификацииЗаказа(ЭтотОбъект,
			ДействиеКалькуляции[0].Объект, ДействиеКалькуляции[0].КодСтрокиЗаказаНаПроизводство);
	КонецЕсли;
	
КонецПроцедуры


#КонецОбласти

#КонецЕсли
